proddy/EMS-ESP32/src/core/system.cpp
/*
 * EMS-ESP - https://github.com/emsesp/EMS-ESP
 * Copyright 2020-2025  emsesp.org - proddy, MichaelDvP
 * 
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#include "system.h"
#include "emsesp.h" // for send_raw_telegram() command

#include "shuntingYard.h"

#ifndef EMSESP_STANDALONE
#include "esp_ota_ops.h"
#endif

#include <semver200.h>

#if defined(EMSESP_TEST)
#include "../test/test.h"
#endif

#ifndef EMSESP_STANDALONE
#ifdef ESP_IDF_VERSION_MAJOR // IDF 4+
#if CONFIG_IDF_TARGET_ESP32  // ESP32/PICO-D4
#include "../esp32/rom/rtc.h"
#elif CONFIG_IDF_TARGET_ESP32S2
#include "../esp32s2/rom/rtc.h"
#elif CONFIG_IDF_TARGET_ESP32C3
#include "../esp32c3/rom/rtc.h"
#elif CONFIG_IDF_TARGET_ESP32S3
#include "../esp32s3/rom/rtc.h"
#else
#error Target CONFIG_IDF_TARGET is not supported
#endif
#else // ESP32 Before IDF 4.0
#include "../rom/rtc.h"
#endif
#include <esp_mac.h>
#endif

#ifndef EMSESP_STANDALONE
#include "esp_efuse.h"
#endif

namespace emsesp {

// Languages supported. Note: the order is important
// and must match locale_translations.h and common.h
#if defined(EMSESP_TEST)
// in Test mode use two languages (en & de) to save flash memory needed for the tests
const char * const languages[] = {EMSESP_LOCALE_EN, EMSESP_LOCALE_DE};
#elif defined(EMSESP_EN_ONLY)
// EN only
const char * const languages[] = {EMSESP_LOCALE_EN};
#elif defined(EMSESP_DE_ONLY)
// EN + DE
const char * const languages[] = {EMSESP_LOCALE_EN, EMSESP_LOCALE_DE};
#else
const char * const languages[] = {EMSESP_LOCALE_EN,
                                  EMSESP_LOCALE_DE,
                                  EMSESP_LOCALE_NL,
                                  EMSESP_LOCALE_SV,
                                  EMSESP_LOCALE_PL,
                                  EMSESP_LOCALE_NO,
                                  EMSESP_LOCALE_FR,
                                  EMSESP_LOCALE_TR,
                                  EMSESP_LOCALE_IT,
                                  EMSESP_LOCALE_SK,
                                  EMSESP_LOCALE_CZ};
#endif

static constexpr uint8_t NUM_LANGUAGES = sizeof(languages) / sizeof(const char *);

uuid::log::Logger System::logger_{F_(system), uuid::log::Facility::KERN};

// init statics
PButton  System::myPButton_;
bool     System::test_set_all_active_ = false;
uint32_t System::max_alloc_mem_;
uint32_t System::heap_mem_;

// Constants for LED flash sequence
static constexpr uint8_t LED_FLASH_RESET_STEP       = 8;
static constexpr uint8_t LED_FLASH_STEP_FIRST       = 3;
static constexpr uint8_t LED_FLASH_STEP_SECOND      = 5;
static constexpr uint8_t LED_FLASH_STEP_THIRD       = 7;
static constexpr uint32_t NTP_TIMEOUT_SECONDS       = 7201; // 2 hours + 1 sec

// Constants for upgrade version checking
static constexpr uint8_t VERSION_MAJOR_3            = 3;
static constexpr uint8_t VERSION_MINOR_6            = 6;

// Constants for system
static constexpr uint8_t WIFI_POWER_LEGACY          = 20;
static constexpr uint8_t WEBLOG_BUFFER_SIZE_DEFAULT = 25;

// Helper function to control LED state - reduces code duplication
static void set_led_state(uint8_t gpio, bool led_type, uint8_t red, uint8_t green, uint8_t blue) {
#ifndef EMSESP_STANDALONE
    if (!gpio) return;
    if (led_type) {
#if ESP_ARDUINO_VERSION_MAJOR < 3
        neopixelWrite(gpio, red, green, blue);
#else
        rgbLedWrite(gpio, red, green, blue);
#endif
    } else {
        // LED_ON macro or constant not defined, fallback: assume active HIGH
        digitalWrite(gpio, (green || red || blue) ? HIGH : LOW);
    }
#endif
}

static bool has_healthcheck_flag(uint8_t healthcheck, uint8_t flag) {
    return (healthcheck & flag) == flag;
}

#ifndef EMSESP_STANDALONE
// Helper to check if IPv6 address is valid and not empty
inline bool is_valid_ipv6(const String & ipv6_str) {
    return (ipv6_str != "0000:0000:0000:0000:0000:0000:0000:0000" && ipv6_str != "::");
}
#endif

// find the index of the language
// 0 = EN, 1 = DE, etc...
uint8_t System::language_index() const {
    const auto & loc = locale();
    for (uint8_t i = 0; i < NUM_LANGUAGES; ++i) {
        if (languages[i] == loc) {
            return i;
        }
    }
    return 0; // EN only
}

// send raw to ems
bool System::command_send(const char * value, const int8_t id) {
    return EMSESP::txservice_.send_raw(value); // ignore id
}

// returns last response from MQTT
bool System::command_response(const char * value, const int8_t id, JsonObject output) {
    JsonDocument doc;
    if (DeserializationError::Ok == deserializeJson(doc, Mqtt::get_response())) {
        for (JsonPairConst p : doc.as<JsonObjectConst>()) {
            output[p.key()] = p.value();
        }
    } else {
        output["response"] = Mqtt::get_response();
    }
    return true;
}

// fetch device values - optimized with lookup table
bool System::command_fetch(const char * value, const int8_t id) {
    std::string value_s;
    if (Helpers::value2string(value, value_s)) {
        if (value_s == "all") {
            LOG_INFO("Requesting data from EMS devices");
            EMSESP::fetch_device_values();
            return true;
        }
        
        // Lookup table for device types - constexpr for compile-time optimization
        static constexpr struct {
            const char * const       name;
            EMSdevice::DeviceType    type;
        } device_types[] = {
            {F_(boiler), EMSdevice::DeviceType::BOILER},
            {F_(thermostat), EMSdevice::DeviceType::THERMOSTAT},
            {F_(solar), EMSdevice::DeviceType::SOLAR},
            {F_(mixer), EMSdevice::DeviceType::MIXER}
        };

        for (const auto & dt : device_types) {
            if (value_s == dt.name) {
                EMSESP::fetch_device_values_type(dt.type);
                return true;
            }
        }
    } else {
        EMSESP::fetch_device_values(); // default if no name or id is given
    }

    return true; // always true
}

// mqtt publish - optimized with lookup table
bool System::command_publish(const char * value, const int8_t id) {
    std::string value_s;
    if (Helpers::value2string(value, value_s)) {
        if (value_s == "ha") {
            EMSESP::publish_all(true); // includes HA
            LOG_INFO("Publishing all data to MQTT, including HA configs");
            return true;
        }
        
