proddy/EMS-ESP32/src/core/system.cpp
#ifdef EMSESP_PINGTEST
        static uint64_t ping_count = 0;
        LOG_NOTICE("Ping test, #%d", ping_count++);
#endif

        // check if we have a valid network connection
        if (!ethernet_connected() && (WiFi.status() != WL_CONNECTED)) {
            healthcheck_ |= HEALTHCHECK_NO_NETWORK;
        } else {
            healthcheck_ &= ~HEALTHCHECK_NO_NETWORK;
        }

        // check if we have a bus connection
        if (!EMSbus::bus_connected()) {
            healthcheck_ |= HEALTHCHECK_NO_BUS;
        } else {
            healthcheck_ &= ~HEALTHCHECK_NO_BUS;
        }

        // see if the healthcheck state has changed
        static uint8_t last_healthcheck_ = 0;
        if (healthcheck_ != last_healthcheck_) {
            last_healthcheck_ = healthcheck_;

            EMSESP::system_.send_heartbeat(); // send MQTT heartbeat immediately when connected

            // see if we're better now
            if (healthcheck_ == 0) {
                // everything is healthy, show LED permanently on or off depending on setting
                set_led_state(led_gpio_, led_type_, 0, hide_led_ ? 0 : RGB_LED_BRIGHTNESS, 0);
            } else {
                // turn off LED so we're ready to the flashes
                set_led_state(led_gpio_, led_type_, 0, 0, 0);
            }
        }
    }
}

// commands - takes static function pointers
// can be called via Console using 'call system <cmd>'
void System::commands_init() {
    Command::add(EMSdevice::DeviceType::SYSTEM, F_(read), System::command_read, FL_(read_cmd), CommandFlag::ADMIN_ONLY);
    Command::add(EMSdevice::DeviceType::SYSTEM, F_(send), System::command_send, FL_(send_cmd), CommandFlag::ADMIN_ONLY);
    Command::add(EMSdevice::DeviceType::SYSTEM, F_(fetch), System::command_fetch, FL_(fetch_cmd), CommandFlag::ADMIN_ONLY);
    Command::add(EMSdevice::DeviceType::SYSTEM, F_(restart), System::command_restart, FL_(restart_cmd), CommandFlag::ADMIN_ONLY);
    Command::add(EMSdevice::DeviceType::SYSTEM, F_(format), System::command_format, FL_(format_cmd), CommandFlag::ADMIN_ONLY);
    Command::add(EMSdevice::DeviceType::SYSTEM, F_(watch), System::command_watch, FL_(watch_cmd));
    Command::add(EMSdevice::DeviceType::SYSTEM, F_(message), System::command_message, FL_(message_cmd));
#if defined(EMSESP_TEST)
    Command::add(EMSdevice::DeviceType::SYSTEM, ("test"), System::command_test, FL_(test_cmd));
#endif

    // these commands will return data in JSON format
    Command::add(EMSdevice::DeviceType::SYSTEM, F("response"), System::command_response, FL_(commands_response));

    // MQTT subscribe "ems-esp/system/#"
    Mqtt::subscribe(EMSdevice::DeviceType::SYSTEM, "system/#", nullptr); // use empty function callback
}

// uses LED to show system health
// 1 x flash = the EMS bus is not connected
// 2 x flash = the network (wifi or ethernet) is not connected
// 3 x flash = both EMS bus and network are failing. This is a critical error!
void System::led_monitor() {
    // we only need to run the LED healthcheck if there are errors
    if (!healthcheck_ || !led_gpio_) {
        return; // all good
    }

    static uint32_t led_long_timer_  = 1; // 1 will kick it off immediately
    static uint32_t led_short_timer_ = 0;
    static uint8_t  led_flash_step_  = 0; // 0 means we're not in the short flash timer
    auto            current_time     = uuid::get_uptime();

    // first long pause before we start flashing
    if (led_long_timer_ && (uint32_t)(current_time - led_long_timer_) >= HEALTHCHECK_LED_LONG_DUARATION) {
        led_short_timer_ = current_time; // start the short timer
        led_long_timer_  = 0;            // stop long timer
        led_flash_step_  = 1;            // enable the short flash timer
    }

    // the flash timer which starts after the long pause
    if (led_flash_step_ && (uint32_t)(current_time - led_short_timer_) >= HEALTHCHECK_LED_FLASH_DUARATION) {
        led_long_timer_     = 0; // stop the long timer
        led_short_timer_    = current_time;
        static bool led_on_ = false;

        if (++led_flash_step_ == LED_FLASH_RESET_STEP) {
            // reset the whole sequence
            led_long_timer_ = uuid::get_uptime();
            led_flash_step_ = 0;
            set_led_state(led_gpio_, led_type_, 0, 0, 0); // LED off
        } else if (led_flash_step_ % 2) {
            // handle the step events (on odd numbers 3,5,7,etc). see if we need to turn on a LED
            //  1 flash is the EMS bus is not connected
            //  2 flashes if the network (wifi or ethernet) is not connected
            //  3 flashes is both the bus and the network are not connected. Then you know you're truly f*cked.
            const bool no_network = has_healthcheck_flag(healthcheck_, HEALTHCHECK_NO_NETWORK);
            const bool no_bus     = has_healthcheck_flag(healthcheck_, HEALTHCHECK_NO_BUS);
            
            if (led_type_) {
                // RGB LED handling
                if (led_flash_step_ == LED_FLASH_STEP_FIRST) {
                    const uint8_t red  = no_network ? RGB_LED_BRIGHTNESS : 0;
                    const uint8_t blue = (!no_network && no_bus) ? RGB_LED_BRIGHTNESS : 0;
                    if (red || blue) {
                        set_led_state(led_gpio_, led_type_, red, 0, blue);
                    }
                } else if (led_flash_step_ == LED_FLASH_STEP_SECOND && no_network) {
                    set_led_state(led_gpio_, led_type_, RGB_LED_BRIGHTNESS, 0, 0); // red
                } else if (led_flash_step_ == LED_FLASH_STEP_THIRD && no_network && no_bus) {
                    set_led_state(led_gpio_, led_type_, 0, 0, RGB_LED_BRIGHTNESS); // blue
                }
            } else {
                // Simple LED handling
                const bool should_flash = (led_flash_step_ == LED_FLASH_STEP_FIRST && (no_network || no_bus)) ||
                                          (led_flash_step_ == LED_FLASH_STEP_SECOND && no_network) ||
                                          (led_flash_step_ == LED_FLASH_STEP_THIRD && no_network && no_bus);
                if (should_flash) {
                    led_on_ = true;
                    digitalWrite(led_gpio_, LED_ON);
                }
            }
        } else if (led_on_) {
            // turn the led off after the flash, on even number count
            set_led_state(led_gpio_, led_type_, 0, 0, 0);
            led_on_ = false;
        }
    }
}

