proddy/EMS-ESP32/src/core/system.cpp
    shell.println();

#endif
}

// see if there is a restore of an older settings file that needs to be applied
// note there can be only one file at a time
bool System::check_restore() {
    bool reboot_required = false; // true if we need to reboot

#ifndef EMSESP_STANDALONE
    File new_file = LittleFS.open(TEMP_FILENAME_PATH);
    if (!new_file) {
        return false;
    }

    JsonDocument         jsonDocument;
    DeserializationError error = deserializeJson(jsonDocument, new_file);
    
    if (error != DeserializationError::Ok || !jsonDocument.is<JsonObject>()) {
        LOG_ERROR("Unrecognized file uploaded, not json.");
        new_file.close();
        LittleFS.remove(TEMP_FILENAME_PATH);
        return false;
    }

    JsonObject  input         = jsonDocument.as<JsonObject>();
    std::string settings_type = input["type"];
    
    if (settings_type == "settings") {
        // It's a settings file. Parse each section separately. If it's system related it will require a reboot
        // Optimized with lookup table - constexpr for compile-time optimization
        static constexpr struct {
            const char * const file;
            const char * const section;
        } settings_sections[] = {
            {NETWORK_SETTINGS_FILE, "Network"},
            {AP_SETTINGS_FILE, "AP"},
            {MQTT_SETTINGS_FILE, "MQTT"},
            {NTP_SETTINGS_FILE, "NTP"},
            {SECURITY_SETTINGS_FILE, "Security"},
            {EMSESP_SETTINGS_FILE, "Settings"}
        };
        
        for (const auto & section : settings_sections) {
            reboot_required |= saveSettings(section.file, section.section, input);
        }
    } else if (settings_type == "customizations") {
        saveSettings(EMSESP_CUSTOMIZATION_FILE, "Customizations", input);
    } else if (settings_type == "schedule") {
        saveSettings(EMSESP_SCHEDULER_FILE, "Schedule", input);
    } else if (settings_type == "entities") {
        saveSettings(EMSESP_CUSTOMENTITY_FILE, "Entities", input);
    } else if (settings_type == "customSupport") {
        // it's a custom support file - save it to /config
        new_file.close();
        if (LittleFS.rename(TEMP_FILENAME_PATH, EMSESP_CUSTOMSUPPORT_FILE)) {
            LOG_INFO("Custom support file stored");
            return false;
        }
        LOG_ERROR("Failed to save custom support file");
        return false;
    } else {
        LOG_ERROR("Unrecognized file uploaded");
    }

    // close (just in case) and remove the temp file
    new_file.close();
    LittleFS.remove(TEMP_FILENAME_PATH);
#endif

    return reboot_required;
}

// handle upgrades from previous versions
// this function will not be called on a clean install, with no settings files yet created
// returns true if we need a reboot
bool System::check_upgrade(bool factory_settings) {
    bool        missing_version = true;
    std::string settingsVersion;

    if (!factory_settings) {
        // fetch current version from settings file
        EMSESP::webSettingsService.read([&](WebSettings const & settings) { settingsVersion = settings.version.c_str(); });

        // see if we're missing a version, will be < 3.5.0b13 from Dec 23 2022
        missing_version = (settingsVersion.empty() || (settingsVersion.length() < 5));
        if (missing_version) {
            LOG_WARNING("No version information found");
            settingsVersion = "3.5.0"; // this was the last stable version without version info
        }
    } else {
        settingsVersion = EMSESP_APP_VERSION; // use the current version
    }

    version::Semver200_version settings_version(settingsVersion);

    if (!missing_version) {
        LOG_DEBUG("Checking for version upgrades (settings file has v%d.%d.%d-%s)",
                  settings_version.major(),
                  settings_version.minor(),
                  settings_version.patch(),
                  settings_version.prerelease().c_str());
    }

    if (factory_settings) {
        return false; // fresh install, do nothing
    }

    version::Semver200_version this_version(EMSESP_APP_VERSION);

    bool save_version = true;

    // compare versions
    if (this_version > settings_version) {
        // we need to do an upgrade
        if (missing_version) {
            LOG_NOTICE("Upgrading to version %d.%d.%d-%s", this_version.major(), this_version.minor(), this_version.patch(), this_version.prerelease().c_str());
        } else {
            LOG_NOTICE("Upgrading from version %d.%d.%d-%s to %d.%d.%d-%s",
                       settings_version.major(),
                       settings_version.minor(),
                       settings_version.patch(),
                       settings_version.prerelease().c_str(),
                       this_version.major(),
                       this_version.minor(),
                       this_version.patch(),
                       this_version.prerelease().c_str());
        }

        // if we're coming from 3.4.4 or 3.5.0b14 which had no version stored then we need to apply new settings
        if (missing_version) {
            LOG_INFO("Upgrade: Setting MQTT Entity ID format to older v3.4 format (0)");
            EMSESP::esp32React.getMqttSettingsService()->update([&](MqttSettings & mqttSettings) {
                mqttSettings.entity_format = Mqtt::entityFormat::SINGLE_LONG; // use old Entity ID format from v3.4
                return StateUpdateResult::CHANGED;
            });
        } else if (settings_version.major() == VERSION_MAJOR_3 && settings_version.minor() <= VERSION_MINOR_6) {
            EMSESP::esp32React.getMqttSettingsService()->update([&](MqttSettings & mqttSettings) {
                if (mqttSettings.entity_format == 1) {
                    mqttSettings.entity_format = Mqtt::entityFormat::SINGLE_OLD; // use old Entity ID format from v3.6
                    LOG_INFO("Upgrade: Setting MQTT Entity ID format to v3.6 format (3)");
                    return StateUpdateResult::CHANGED;
                } else if (mqttSettings.entity_format == 2) {
                    mqttSettings.entity_format = Mqtt::entityFormat::MULTI_OLD; // use old Entity ID format from v3.6
                    LOG_INFO("Upgrade: Setting MQTT Entity ID format to v3.6 format (4)");
                    return StateUpdateResult::CHANGED;
                }
                return StateUpdateResult::UNCHANGED;
            });
        }

        // changes to Network
        EMSESP::esp32React.getNetworkSettingsService()->update([&](NetworkSettings & networkSettings) {
            // Network Settings Wifi tx_power is now using the value * 4.
            if (networkSettings.tx_power == WIFI_POWER_LEGACY) {
                networkSettings.tx_power = WIFI_POWER_19_5dBm; // use 19.5 as we don't have 20 anymore
                LOG_INFO("Upgrade: Setting WiFi TX Power to Auto");
            }

