proddy/EMS-ESP32/src/core/system.cpp
            // force WiFi sleep to off (was default on < 3.7.0-dev-33)
            networkSettings.nosleep = true;
            LOG_INFO("Upgrade: Disabling WiFi nosleep");

            return StateUpdateResult::CHANGED;
        });

        // changes to application settings
        EMSESP::webSettingsService.update([&](WebSettings & settings) {
            // force web buffer to 25 for those boards without psram
            if (EMSESP::system_.PSram() == 0) {
                settings.weblog_buffer = WEBLOG_BUFFER_SIZE_DEFAULT;
                return StateUpdateResult::CHANGED;
            }
            return StateUpdateResult::UNCHANGED;
        });


    } else if (this_version < settings_version) {
        // need downgrade
        LOG_NOTICE("Downgrading to version %d.%d.%d-%s", this_version.major(), this_version.minor(), this_version.patch(), this_version.prerelease().c_str());
    } else {
        // same version, do nothing
        save_version = false;
    }

    // if we did a change, set the new version and save it, then reboot
    if (save_version) {
        EMSESP::webSettingsService.update([&](WebSettings & settings) {
            settings.version = EMSESP_APP_VERSION;
            return StateUpdateResult::CHANGED;
        });
        // LOG_INFO("Upgrade: Setting version to %s", EMSESP_APP_VERSION);
        return true; // need reboot
    }

    return false;
}

// convert settings file into json object
void System::extractSettings(const char * filename, const char * section, JsonObject output) {
#ifndef EMSESP_STANDALONE
    File settingsFile = LittleFS.open(filename);
    if (settingsFile) {
        JsonDocument         jsonDocument;
        DeserializationError error = deserializeJson(jsonDocument, settingsFile);
        if (error == DeserializationError::Ok && jsonDocument.is<JsonObject>()) {
            JsonObjectConst jsonObject = jsonDocument.as<JsonObjectConst>();
            JsonObject node       = output[section].to<JsonObject>();
            for (JsonPairConst kvp : jsonObject) {
                node[kvp.key()] = kvp.value();
            }
        }
    }
    settingsFile.close();
#endif
}

// save settings file using input from a json object
bool System::saveSettings(const char * filename, const char * section, JsonObject input) {
#ifndef EMSESP_STANDALONE
    JsonObject section_json = input[section];
    if (section_json) {
        File section_file = LittleFS.open(filename, "w");
        if (section_file) {
            LOG_INFO("Applying new uploaded %s data", section);
            serializeJson(section_json, section_file);
            section_file.close();
            return true; // reboot required
        }
    }
#endif
    return false; // not found
}

// set a entity of services 'network', 'settings', 'mqtt', etc.
bool System::command_service(const char * cmd, const char * value) {
    bool b;
    if (Helpers::value2bool(value, b)) {
        if (!strcmp(cmd, "settings/showertimer")) {
            EMSESP::webSettingsService.update([&](WebSettings & settings) {
                settings.shower_timer = b;
                return StateUpdateResult::CHANGED;
            });
            EMSESP::shower_.shower_timer(b);
            LOG_INFO("System command '%s' with value '%s'", cmd, value);
            return true;
        }
        
        if (!strcmp(cmd, "settings/showeralert")) {
            EMSESP::webSettingsService.update([&](WebSettings & settings) {
                settings.shower_alert = b;
                return StateUpdateResult::CHANGED;
            });
            EMSESP::shower_.shower_alert(b);
            LOG_INFO("System command '%s' with value '%s'", cmd, value);
            return true;
        }
        
        if (!strcmp(cmd, "settings/hideled")) {
            EMSESP::webSettingsService.update([&](WebSettings & settings) {
                settings.hide_led = b;
                return StateUpdateResult::CHANGED;
            });
            EMSESP::system_.hide_led(b);
            LOG_INFO("System command '%s' with value '%s'", cmd, value);
            return true;
        }
        
        if (!strcmp(cmd, "settings/analogenabled")) {
            EMSESP::webSettingsService.update([&](WebSettings & settings) {
                settings.analog_enabled = b;
                return StateUpdateResult::CHANGED;
            });
            EMSESP::system_.analog_enabled(b);
            LOG_INFO("System command '%s' with value '%s'", cmd, value);
            return true;
        }
        
        if (!strcmp(cmd, "mqtt/enabled")) {
            EMSESP::esp32React.getMqttSettingsService()->update([&](MqttSettings & Settings) {
                Settings.enabled = b;
                return StateUpdateResult::CHANGED;
            });
            LOG_INFO("System command '%s' with value '%s'", cmd, value);
            return true;
        }
        
        if (!strcmp(cmd, "ap/enabled")) {
            EMSESP::esp32React.getAPSettingsService()->update([&](APSettings & Settings) {
                Settings.provisionMode = b ? 0 : 2;
                return StateUpdateResult::CHANGED;
            });
            LOG_INFO("System command '%s' with value '%s'", cmd, value);
            return true;
        }
        
        if (!strcmp(cmd, "ntp/enabled")) {
            EMSESP::esp32React.getNTPSettingsService()->update([&](NTPSettings & Settings) {
                Settings.enabled = b;
                return StateUpdateResult::CHANGED;
            });
            LOG_INFO("System command '%s' with value '%s'", cmd, value);
            return true;
        }
        
        if (!strcmp(cmd, "syslog/enabled")) {
            EMSESP::webSettingsService.update([&](WebSettings & settings) {
                settings.syslog_enabled = b;
                return StateUpdateResult::CHANGED;
            });
            EMSESP::system_.syslog_enabled_ = b;
            EMSESP::system_.syslog_init();
            LOG_INFO("System command '%s' with value '%s'", cmd, value);
            return true;
        }
    }
    int n;
    if (Helpers::value2number(value, n)) {
#ifndef EMSESP_STANDALONE
        if (!strcmp(cmd, "fuse/mfg")) {
            bool success = esp_efuse_write_reg(EFUSE_BLK3, 0, (uint32_t)n) == ESP_OK;
            if (success) {
                LOG_INFO("fuse programed with value '%X': successful", n);
            } else {
                LOG_ERROR("fuse programed with value '%X': failed", n);
            }
            return success;
        }
        if (!strcmp(cmd, "fuse/mfgadd")) {
            uint8_t reg = 0;
            while (esp_efuse_read_reg(EFUSE_BLK3, reg) != 0 && reg < 7) {
                reg++;
            }
            bool success = esp_efuse_write_reg(EFUSE_BLK3, reg, (uint32_t)n) == ESP_OK;
            if (success) {
                LOG_INFO("fuse %d programed with value '%X': successful", reg, n);
            } else {
                LOG_ERROR("fuse %d programed with value '%X': failed", reg, n);
            }
            return success;
        }
#endif
    }

