proddy/EMS-ESP32/src/core/system.cpp
// set NTP status
void System::ntp_connected(bool b) {
    if (b != ntp_connected_) {
        if (b) {
            LOG_INFO("NTP connected");
        } else {
            LOG_WARNING("NTP disconnected"); // if turned off report it
        }
    }

    ntp_connected_  = b;
    ntp_last_check_ = b ? uuid::get_uptime_sec() : 0;
}

// get NTP status
bool System::ntp_connected() {
    // timeout 2 hours, ntp sync is normally every hour.
    if ((uuid::get_uptime_sec() - ntp_last_check_ > NTP_TIMEOUT_SECONDS) && ntp_connected_) {
        ntp_connected(false);
    }

    return ntp_connected_;
}

// see if its a BBQKees Gateway by checking the nvs values
std::string System::getBBQKeesGatewayDetails(uint8_t detail) {
#ifndef EMSESP_STANDALONE
    /*
    if (!EMSESP::nvs_.isKey("mfg")) {
        return "";
    }

    // mfg can be either "BBQKees" or "BBQKees Electronics"
    auto mfg = EMSESP::nvs_.getString("mfg");
    if (mfg) {
        if (!mfg.startsWith("BBQKees")) {
            return "";
        }
    }

    return "BBQKees Gateway Model " + EMSESP::nvs_.getString("model") + " v" + EMSESP::nvs_.getString("hwrevision") + "/" + EMSESP::nvs_.getString("batch");
*/
    union {
        struct {
            uint32_t no : 4;
            uint32_t month : 4;
            uint32_t year : 8;
            uint32_t rev_minor : 4;
            uint32_t rev_major : 4;
            uint32_t model : 4;
            uint32_t mfg : 4;
        };
        uint32_t reg;
    } gw;
    for (uint8_t reg = 0; reg < 8; reg++) {
        gw.reg = esp_efuse_read_reg(EFUSE_BLK3, reg);
        if (reg == 7 || esp_efuse_read_reg(EFUSE_BLK3, reg + 1) == 0)
            break;
    }
    static constexpr const char * const mfg[]   = {"unknown", "BBQKees Electronics", "", "", "", "", "", ""};
    static constexpr const char * const model[] = {"unknown", "S3", "E32V2", "E32V2.2", "S32", "E32", "", "", ""};
    static constexpr const char * const board[] = {"CUSTOM", "S32S3", "E32V2", "E32V2_2", "S32", "E32", "", "", ""};
    switch (detail) {
    case FUSE_VALUE::MFG:
        return gw.mfg < 2 ? std::string(mfg[gw.mfg]) : "unknown";
    case FUSE_VALUE::MODEL:
        return gw.model < 6 ? std::string(model[gw.model]) : "unknown";
    case FUSE_VALUE::BOARD:
        return gw.model < 6 ? std::string(board[gw.model]) : board_profile_;
    case FUSE_VALUE::REV: {
        char buf[16];
        snprintf(buf, sizeof(buf), "%u.%u", gw.rev_major, gw.rev_minor);
        return std::string(buf);
    }
    case FUSE_VALUE::BATCH: {
        char buf[16];
        snprintf(buf, sizeof(buf), "%u%02u%u", 2000 + gw.year, gw.month, gw.no);
        return std::string(buf);
    }
    case FUSE_VALUE::FUSE: {
        char buf[16];
        snprintf(buf, sizeof(buf), "0x%x", gw.reg);
        return std::string(buf);
    }
    case FUSE_VALUE::ALL:
    default:
        break;
    }
    if (!gw.reg || gw.mfg > 1 || gw.model > 5) {
        return "";
    }
    char buf[128];
    snprintf(buf, sizeof(buf), "%s %s rev.%u.%u/%u%02u%u", mfg[gw.mfg], model[gw.model], gw.rev_major, gw.rev_minor, 2000 + gw.year, gw.month, gw.no);
    return std::string(buf);
#else
    return "";
#endif
}

// Stream from an URL and send straight to OTA uploader service.
//
// This function needs to be called twice, 1st pass once with a url to persist it, 2nd pass with no arguments to start the upload
// This is to avoid timeouts in callback functions, like calling from a web hook.
bool System::uploadFirmwareURL(const char * url) {
#ifndef EMSESP_STANDALONE

    static std::string saved_url;

    if (url && strlen(url) > 0) {
        // if the passed URL is "reset" abort the current upload. This is called when an error happens during OTA
        if (strncmp(url, "reset", 5) == 0) {
            LOG_DEBUG("Firmware upload - resetting");
            saved_url.clear();
            return true;
        }

        // given a URL to download from, save it ready for the 2nd pass
        saved_url = url;
        LOG_INFO("Firmware location: %s", saved_url.c_str());
        EMSESP::system_.systemStatus(SYSTEM_STATUS::SYSTEM_STATUS_PENDING_UPLOAD); // we're ready to start the upload
        return true;
    }

    // check we have a valid URL from the 1st pass
    if (saved_url.empty()) {
        LOG_ERROR("Firmware upload failed - invalid URL");
        return false; // error
    }

    Shell::loop_all(); // flush log buffers so latest messages are shown in console

    // Configure temporary client
    HTTPClient http;
    http.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS); // important for GitHub 302's
    http.setTimeout(8000);
    http.useHTTP10(true); // use HTTP/1.0 for update since the update handler does not support any transfer Encoding
    http.begin(saved_url.c_str());

    // start a connection, returns -1 if fails
    int httpCode = http.GET();
    if (httpCode != HTTP_CODE_OK) {
        LOG_ERROR("Firmware upload failed - HTTP code %d", httpCode);
        http.end();
        return false; // error
    }

    // check we have enough space for the upload in the ota partition
    int firmware_size = http.getSize();
    LOG_INFO("Firmware uploading (size: %d bytes). Please wait...", firmware_size);
    if (!Update.begin(firmware_size)) {
        LOG_ERROR("Firmware upload failed - no space");
        http.end();
        return false; // error
    }

    Shell::loop_all(); // flush log buffers so latest messages are shown in console

    // we're about to start the upload, set the status so the Web System Monitor spots it
    EMSESP::system_.systemStatus(SYSTEM_STATUS::SYSTEM_STATUS_UPLOADING);
    // TODO do we need to stop the UART first with EMSuart::stop() ?

    // set a callback so we can monitor progress in the WebUI
    Update.onProgress([](size_t progress, size_t total) { EMSESP::system_.systemStatus(SYSTEM_STATUS::SYSTEM_STATUS_UPLOADING + (progress * 100 / total)); });

    // get tcp stream and send it to Updater
    WiFiClient * stream = http.getStreamPtr();
    if (Update.writeStream(*stream) != firmware_size) {
        LOG_ERROR("Firmware upload failed - size differences");
        http.end();
        EMSESP::system_.systemStatus(SYSTEM_STATUS::SYSTEM_STATUS_ERROR_UPLOAD);
        return false; // error
    }

